Console.Clear();

// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]

Console.WriteLine ("Введите число");
int Digit = int.Parse(Console.ReadLine());

Console.WriteLine(Digit0);

